<template>
  <div class="oferta">
    <div class="row">
      <div class="col-md-12">
        <Title
            class="animate__animated animate__fadeInDown"
            :title="'оферта'"
            :subtitle="'публичная'"
            :content="'Прими или покинь страницы этого сайта..'"
        />
      </div>
      <div class="col-md-8 offset-md-2">
        <div class="page-content">
          Настоящий документ представляет собой предложение правообладателя
          майнкрафт-сервера ZabbixMC (далее – «Администрация») физическим лицам (далее –
          «Пользователи»), принявшим (акцептовавшим) настоящее предложение на
          заключение договора оказания услуг, оказываемых Администрацией с помощью
          программы для ЭВМ (веб-сайта), размещённой в информационнотелекоммуникационной сети Интернет по адресу https://[zabmc.ru](http://zabmc.ru/) (далее – «Сайт»). В соответствии с пунктом 3 статьи 438 ГК РФ акцепт оферты равносилен заключению договора на условиях, изложенных в оферте.

          Пользователь обязан полностью ознакомиться с настоящим документом до
          момента пользования ресурсами Сайта, начала поиска услуги и оформления заказа
          услуги на Сайте.

          Зарегистрировавшись на Сайте, а также используя Сайт или воспользовавшись
          любой его функциональной возможностью, обратившись к любой странице Сайта без
          регистрации, Пользователь выражает свое безоговорочное согласие со всеми
          условиями настоящей Оферты и обязуется их соблюдать или прекратить
          использование Сайта, на следующих условиях:

          ## 1. **Определения и термины**

          1.1. Нижеприведенные термины используются в настоящем документе в
          следующем значении:
          «Акцепт Оферты» - полное и безоговорочное принятие Пользователем условий
          настоящей публичной оферты путем совершения действий, указанных в ней.
          «Пользователь» - физическое лицо, посетитель Сайта, который знакомится с
          каталогом Услуг, представленных Администрацией, пользуется справочными и
          информационными ресурсами Сайта, собирается сделать Заказ Услуг, или уже
          осуществляет Заказ в режиме реального времени, или который уже использует
          Услуги, приобретенные им ранее у Администрации.
          «Администрация» («Администрация») - правообладатель майнкрафт-сервера
          ZabbixMC, который оказывает Услуг посредством Сайта.
          «Сайт» - Интернет-ресурс Администрации, расположенный по адресу
          https:/[/](zabmc.ru)[zabmc.ru](http://zabmc.ru/), содержащий в себе все технические возможности, необходимые
          для осуществления Пользователем просмотра описаний Услуг и их приобретения
          (заказа). Исключительные права на Сайт принадлежат Администрации.
          «Услуги» - услуги, реализуемые Администрацией Пользователям, информация
          о которых размещена на Сайте (привилегированный вход на игровой сервер Игры,
          передача Пользователю игровой валюты и игровых ключей от кейсов при из заказе
          Пользователем для дальнейшей их реализации в Игре). Информация об Услугах
          размещена на Сайте.

          «Игра» - компьютерная игра Minecraft (Майнкрафт) в жанре песочницы,
          принадлежащая компании Mojang AB.
          «Договор» - договор оказания услуг, заключаемый между Администрацией и
          Пользователем путем Акцепта оферты последним.
          «Заказ» - заявка Пользователя на приобретение Услуг у Администрации,
          оформленная через Сайт и представляющая собой свободное и самостоятельное
          намерение и волеизъявление Пользователя приобрести у Администрации выбранную
          Пользователем Услугу.

          1.2. В настоящей Оферте могут быть использованы термины, не определенные
          в пункте 1.1. Оферты. В этих случаях толкование терминов производится в
          соответствии с текстом и смыслом данной Оферты. В случае отсутствия
          однозначного толкования термина в тексте Оферты, следует руководствоваться, вопервых, толкованием терминов, применяемым на Сайте, в том числе в юридической
          документации, размещенной на Сайте; во-вторых, законодательством Российской
          Федерации и обычаями деловой практики в соответствующей сфере деятельности.

          ## 2. Общие положения

          2. Общие положения
          2.1. Поиск, заказ, оплата Пользователем Услуг, размещенных на Сайте,
          использование Сайта, включая просмотр размещенной в разделах Сайта информации,
          пользуется справочными и информационными ресурсами Сайта, означает согласие
          Пользователя с настоящей Офертой.
          2.2. Администрация имеет право вносить изменения в Оферту без
          уведомления Пользователя.
          2.3. Администрация и Пользователь предоставляют взаимные гарантии своих
          прав и дееспособности, необходимых для заключения Договора и его исполнения на
          базе настоящей Оферты.
          2.4. Наименование, ассортимент и вид Услуг, их описание, стоимость и
          способы оплаты, а также иные условия, указываются на Сайте на соответствующей
          веб-странице Сайта.
          2.5. Данные об Исполнителе, его контактные данные можно найти на
          страницах Сайта.
          2.6. Оферта не требует скрепления печатями и/или подписания
          Администрацией и Пользователем (далее по тексту – «Стороны») на бумажном
          носителе, сохраняя при этом полную юридическую силу.
          2.7. Заключаемый между сторонами Договор имеет силу акта об оказании
          Услуг. Приемка-передача Товара производится без подписания между Сторонами
          соответствующих актов.

          ## 3. Предмет Оферты.

          3.1. При Заказе Пользователем Услуг через Сайт Администрация оказывает
          следующие Услуги Пользователю, представленные на Сайте:
          3.1.1. «Привилегия» - предоставление Пользователю привилегированного
          входа на сервер Игры, дающая Пользователю возможность реализации
          дополнительного функционала на игровом сервере Игры и выделять Пользователя
          среди других Пользователей.
          3.1.2. «Валюта» - зачисление на аккаунт Пользователя соответствующей
          валюты Игры и предоставление Пользователю возможности покупать в Игре
          различные ресурсы (предметы), улучшать свой аккаунт в Игре.
          3.1.3. «Кейсы» - "сундуки удачи" (лотерея), из которых Пользователь может
          выиграть привилегию, игровые ресурсы или валюту. Для их открытия необходимы
          соответствующие ключи.
          3.1.4. «Прочее» - дополнительный функционал, который предоставляет на
          игровой аккаунт Пользователя иные услуги.
          3.2. Стоимость Услуг, а также прочие необходимые условия Оферты
          определяются на основании сведений, предоставленных Пользователем при
          оформлении Заказа.
          3.3. Все Услуги предоставляются исключительно для пользования в Игре на
          игровом сервере.
          3.4. Использование материалов и функций Сайта регулируется нормами
          действующего законодательства Российской Федерации.
          3.5. Пользователь несет персональную ответственность за проверку настоящей
          Оферты на наличие изменений в ней.
          3.6. При несогласии Пользователя с соответствующими изменениями
          Пользователь обязан прекратить использование Сайта и отказаться от Услуг,
          предоставляемых Администрацией. В противном случае продолжение использования
          Пользователем Сайта означает, что Пользователь согласен с условиями Оферты в
          новой редакции.

          ## 4. Момент заключения Оферты (акцепт Оферты)

          4.1. Акцептом настоящей Оферты (и как итог – заключение Договора)
          является оформление Пользователем Заказа в соответствии с условиями настоящей
          Оферты.
          4.2. Оферта вступает в силу с момента Акцепта и действует до полного
          исполнения Сторонами своих обязательств.
          4.3. Осуществляя Акцепт Оферты Пользователь гарантирует, что
          ознакомлен, соглашается, полностью и безоговорочно принимает все условия Оферты
          в том виде, в каком они изложены в тексте Оферты, в том числе в приложениях к
          Оферте, являющихся неотъемлемой частью Оферты (п. 3 ст. 438 ГК РФ).
          4.4. Пользователь понимает, что Акцепт Оферты равносилен заключению
          договора на условиях, изложенных в Оферте.
          4.5. Совершая действия по акцепту Оферты Пользователь гарантирует, что
          он имеет законные права вступать в договорные отношения с Администрацией.
          4.6. Акцептируя настоящую Оферту, Пользователь выражает согласие в том,
          что:
          4.6.1. никнейм Пользователя указан им добровольно;
          4.6.2. иные данные, добровольно указанные Пользователем при Заказе,
          передаются Администрации в электронной форме по каналам связи сети Интернет;
          4.6.3. данные переданы Продавцу для реализации целей, указанных в
          настоящей Оферте;
          4.6.4. данное Пользователем согласие на обработку его данных является
          бессрочным и может быть отозвано Пользователем или его законным
          представителем, подачей письменного заявления, переданного Администрации.

          ## 5. Права и обязанности Сторон

          5.1. Администрация обязуется:
          5.1.1. Принять Заказ Пользователя согласно установленным на Сайте формам.
          5.1.2. Предоставлять достоверную информацию об Услугах.
          5.1.3. На основании Заказа оказать соответствующую Услугу.
          5.1.4. Давать устные и письменные консультации Пользователю по
          дополнительным вопросам Пользователя.
          5.1.5. Обеспечивать своевременное оказание Услуг.
          5.1.6. Использовать информацию, предоставленную Пользователем, только для
          оказания Услуг.
          5.1.7. Рассматривать и проверять мотивированные претензии, поступающие от
          Пользователя.
          5.2. Администрация в праве:
          5.2.1. Отказаться от исполнения Договора в одностороннем порядке при
          нарушении Пользователем условий, указанных в Оферте.
          5.2.2. Отказать Пользователю в исполнении его Заказа без объяснения
          причин.
          5.2.3. Расширять и сокращать предложение Услуг на Сайта, регулировать
          доступ к заказу Услуг, а также приостанавливать или прекращать реализацию любых
          Услуг по своему собственному усмотрению.
          5.2.4. Изменять условия Оферты в одностороннем порядке.
          5.2.5. Отказать в оказании Услуг Пользователю в случае не поступления
          оплаты за Услугу в установленные в Оферте сроки, а также при отсутствии от
          Пользователя своевременно полученного Заказа или иных действий Пользователя,
          необходимых для оказания ему Услуги.
          5.2.6. Получать от Пользователя любую информацию, необходимую для
          выполнения своих обязательств по Оферте. В случае непредставления либо
          неполного или неверного представления Пользователем информации Администрация
          вправе приостановить исполнение своих обязательств по Оферте до представления
          необходимой информации.
          5.2.7. Приостановить работу Сайта в любое время без предварительного
          уведомления в целях обновления Сайта, проведения профилактических работ, в
          случае технических сбоев, действием и/или бездействием третьих лиц и по иным
          причинам, не зависящим от Администрации.
          5.2.8. За нарушение условий настоящей Оферты заблокировать доступ
          Пользователя к Сайту без объяснения причин.
          5.2.9. Не возвращать вещи, потерянные в результате бага, отката, обмана,
          гриферства, воровства и т.д.
          5.3. Пользователь обязуется:
          5.3.1. Знакомиться с информацией об Услугах, их ассортименте и условиях их
          приобретения до оформления Заказа.
          5.3.2. Самостоятельно и своевременно знакомится со всей информацией,
          размещаемой на Сайте, уведомлениях.
          5.3.3. Предоставить при оформлении Заказа только достоверные данные.
          5.3.4. Действовать добросовестно и не злоупотреблять своими правами, в
          частности не приобретать Услуги с целью совершения недобросовестных действий,
          причиняющих ущерб, убытки или затраты для иных Пользователей, Игры,
          Администрации.
          5.3.5. Не использовать информацию, полученную от Администрации
          способами, способными привести к нанесению ущерба интересам Администрации.
          5.3.6. Не использовать материалы Сайта без согласия Администрации как
          правообладателя (статья 1270 ГК РФ).
          5.3.7. При цитировании материалов Сайта в электронном виде размещать
          активные гиперссылки на главную страницу Сайта или на страницу размещения
          соответствующего материала. При использовании информации на любом другом
          носителе необходимо указание источника в виде «Источник: https://[zabmc.ru](http://zabmc.ru/)».
          5.3.8. Оплатить Услугу в полном объеме.
          5.3.9. Незамедлительно уведомлять Администрации о наличии претензий к
          Услуге (при наличии таковых).
          5.4. Пользователь вправе:
          5.4.1. Отказаться от оплаты Услуг, аннулировав Заказ, о чем немедленно
          известить Администрацию. При этом Пользователь обязан компенсировать
          возможные убытки, причиненные Администрации в связи с выполнением принятого в
          работу Заказа.
          5.4.2. Требовать от Администрации надлежащего и своевременного оказания
          Услуг.
          5.4.3. Осуществить выбор Услуг.
          5.4.4. Обращаться к Администрации по всем вопросам, связанным с оказанием
          Услуг.

          ## 6. Финансовые условия

          6.1. Покупка Услуги является добровольным пожертвованием на развитие Сайта и не подлежит возврату.
          6.2. Стоимость Услуг определяется Администрацией самостоятельно и
          указываются на страницах Сайта.
          6.3. Администрация вправе без объяснения причин и без предварительного
          уведомления Пользователей в одностороннем порядке изменять стоимость Товаров
          путем публикации новой стоимости Услуг на Сайте.
          6.4. Цена Товара указывается в рублях РФ. Все взаиморасчеты ведутся в
          рублях РФ.
          6.5. Стоимость Услуг включает в себя все комиссии, взимаемые платежными
          системами, с использованием которых производится оплата стоимости Услуг
          Пользователем.
          6.6. Основанием для оплаты стоимости Услуг является оформляемый
          Пользователем Заказ.
          6.7. Оплата стоимости Услуг производится Пользователем способами,
          установленными в соответствии с техническим и технологическим устройством
          Сайта.
          6.8. Оплата стоимости Услуг производится Пользователем на условиях 100 %
          (стопроцентной) предварительной оплаты.
          6.9. Датой оплаты признается дата поступления средств на расчетный счет
          Администрации.
          6.10. Более подробную информацию о финансовых условиях Пользователь
          может получить по электронной почте contact@[zabmc.ru](http://zabmc.ru/) .

          ## 7. Порядок приобретения Услуг. Гарантии.

          7.1. Пользователь вправе оформить Заказ на любую Услугу, представленную
          на Сайте и в любом количестве.
          7.2. Пользователь осуществляет выбор Услуг из перечня Услуг,
          предложенных на Сайте, и нажатие на кнопку «Купить» на веб-странице с описанием
          соответствующей Услуги.
          7.3. Пользователь, реализуя алгоритм, предложенный Сайтом,
          самостоятельно создает Заказ через соответствующий веб-интерфейс.
          7.4. Выбор Услуг, оформление Заказа и все последующие действия
          Пользователя, описанные в настоящем разделе, осуществляются им без участия
          Администрации.
          7.5. Для того, чтобы оформить Заказ на Сайте Пользователю необходимо
          предоставить Продавцу никнейм с сервера Игры и промокод (при наличии).
          7.6. Выбор способа оплаты и совершение иных сопутствующих действий,
          необходимых в связи с требованиями соответствующей выбранной платежной
          системы возлагается на Пользователя.
          7.7. Администрация не несет ответственности за содержание и достоверность
          информации, предоставленной Пользователем при оформлении Заказа. Пользователь
          берет на себя полную ответственность за предоставление неправильных данных о
          себе, своем аккаунте в Игре, которое сделало невозможным надлежащее исполнение
          Администрацией настоящей Оферты.
          7.8. Заказ с Сайта передается в программу Администрации автоматически.
          7.9. Администрация считается исполнившей свои обязательства по
          настоящей Оферте с момента предоставления Пользователю результата Услуг,
          описанных в п. 3.1. Оферты.

          ## 8. Ответственность

          8.1. При неисполнении или ненадлежащем исполнении обязательств
          Стороны несут ответственность, предусмотренную действующим законодательством
          РФ.
          8.2. Пользователь не имеет права продавать игровые аккаунты, валюту и
          ресурсы за реальные деньги третьим лицам.
          8.3. Администрация никак не принуждает Пользователя, не настаивает
          делать какие-либо действия посредством Сайта.
          8.4. Пользователь признает и соглашается, что:
          8.4.1. Он на добровольной основе вкладывает реальные деньги с целью
          получения результата Услуг.
          8.4.2. В техническое устройство Игры, для использования которой оказывается
          Услуга, могут быть внесены изменения со стороны производителя. В указанных
          случаях Пользователь обязуется не предъявлять в адрес Администрации какие-либо
          претензии и требования.
          8.4.3. Он несет ответственность за свои действия, совершенные на Сайте или
          сервере с его учетной записи.
          8.4.4. Внутренней политикой производителя компьютерной Игры могут быть
          установлены ограничения на передачу/применение результата Услуг, в связи с чем со
          стороны производителя могут проводиться мероприятия по блокировке
          соответствующих пользователей, использующих данный результат Услуг или
          совершаться иные действия, направленные на недопущение использования Игры.
          Администрация не несет ответственность в указанной части, а Пользователь
          обязуется не предъявлять к ней претензии или требования, самостоятельно неся все
          негативные последствия указанных ограничений со стороны производителя.
          8.4.5. Услуги, приобретаемые Пользователем, предоставляется по принципу
          «как есть». При этом Администрация не несет ответственность в какой бы то ни было
          форме за несоответствие результата Услуг целям, задачам, представлениям или
          желаниям Пользователя.
          8.4.6. Ничто в настоящей Оферте не может гарантировать для Пользователя
          полное удовлетворение его интересов и потребностей, связанных с приобретением
          Услуг.
          8.5. Администрация не несет ответственности:
          8.5.1. За убытки и расходы, возникшие у Пользователя, в частности, убытки и
          расходы, вызванные действиями/бездействием третьих лиц и/или возникшие в связи
          со сбоями и перерывами в работе Сайта и/или возникшие в связи с воздействием
          компьютерных вирусов, «троянов», «червей» и т.д. и/или связанные с блокировкой
          Пользователя, использующего результат Услуг, после ее заказа, вне зависимости от
          причины блокировки.
          8.5.2. За аккаунт Пользователя.
          8.5.3. За неполучение результата Услуг Пользователем по причинам не
          зависящим от воли Администрации (отсутствие у Пользователя необходимого
          программного обеспечения, возможности выхода в Интернет, действий провайдеров,
          энергетических компаний, производителя Игры, воздействием компьютерных
          вирусов и (или) вредоносных программ и т.п.).

          ## 9. Разрешение споров.

          9.1. Все споры, разногласия и претензии Стороны будут стремиться решить
          путем переговоров. Сторона, у которой возникли претензии и/или разногласия,
          направляет другой Стороне сообщение с указанием возникших претензий и/или
          разногласий.
          9.2. Сообщение направляется Пользователем по электронной почте на адрес
          contact@[zabmc.ru](http://zabmc.ru/). Сообщение должно содержать суть предъявляемого требования,
          доказательства, подтверждающие требование.
          9.3. В течение 10 (десяти) дней с момента получения оригинала сообщения,
          Сторона, получившая его, обязана направить ответ на это сообщение.
          9.4. В случае, если ответ на сообщение не будет получен направившей
          сообщение Стороной в течение 30 (Тридцати) рабочих дней с даты направления
          соответствующего сообщения, либо если Стороны не придут к соглашению по
          возникшим претензиям и/или разногласиям спор подлежит рассмотрению в суде в
          соответствии с законодательством РФ.
          9.5. За неисполнение или ненадлежащее исполнение обязательств по
          настоящем Договоре, стороны несут ответственность в соответствии с
          законодательством Российской Федерации.

          ## 10.Срок действия Оферты

          10.1. Настоящая Оферта вступает в силу с момента ее размещения в сети
          Интернет на Сайте.
          10.2. Настоящая Оферта размещена на неопределенный срок и утрачивает
          свою силу при ее аннулировании Администрацией.
          10.3. Пользователь соглашается и признает, что внесение изменений в Оферту
          влечет за собой внесение этих изменений в заключенный и действующий между
          Пользователем и Администрацией Договор, и эти изменения вступают в силу
          одновременно с такими изменениями в Договор.

          ## 11.Исключительные права

          11.1. Все объекты, доступные на Сайте, в том числе элементы дизайна, текст,
          графические изображения, видео, и другие объекты (далее – «материалы»), а также
          любые Товары, размещенные на Сайте, являются объектами исключительных прав
          Администрации и других правообладателей (в том числе, производителей Товаров)
          соответственно.
          11.2. Материалы Сайта, а также любой контент, размещенный на Сервисе, не
          могут быть использованы без предварительного разрешения правообладателя(-ей)
          (статья 1270 ГК РФ).
          11.3. Использование Пользователем материалов, а также любого контента в
          личных, некоммерческих целях, возможно при условии сохранения всех знаков
          охраны авторского права, товарных знаков, и сохранении соответствующего объекта
          в неизменном виде. Исключение составляют случаи, прямо предусмотренные
          законодательством.
          11.4. При цитировании материалов Сайта Пользователь обязуется в
          электронном виде размещать активные гиперссылки на главную страницу Сайта или
          на страницу размещения соответствующего материала. При использовании
          информации на любом другом носителе необходимо указание источника в виде
          «Источник https://[zabmc.ru](http://zabmc.ru/) ».

          ## 12.Дополнительные условия

          12.1. Администрация вправе переуступать либо каким-либо иным способом
          передавать свои права и обязанности, вытекающие из его отношений с
          Пользователем, третьим лицам.
          12.2. Сайт и предоставляемые сервисы могут временно частично или
          полностью недоступны по причине проведения профилактических, иных работ или
          по любым другим причинам технического характера. Техническая служба Сайта
          имеет право периодически проводить необходимые профилактические или иные
          работы с предварительным уведомлением Пользователей или без такового.
          12.3. К отношениям между Пользователем и Администрацией применяются
          положения Российского законодательства.
          12.4. Признание судом недействительности какого-либо положения настоящей
          Оферты не влечет за собой недействительность остальных положений.

          ## 13. Реквизиты Администрации

          Электронная почта: contact@[zabmc.ru](http://zabmc.ru/)
        </div>
      </div>
    </div>
  </div>
</template>

<script lang="ts">
import {Component, Vue} from 'vue-property-decorator'
import Title from "@/components/Title.vue"

@Component({
  components: {
    Title,
  }
})
export default class extends Vue {
}
</script>

<style lang="stylus" scoped>
.page-content
  background #ffffff
  padding 40px 30px
  border-radius 7px
  box-shadow 6px 2px 8px 1px #f0f0f9
</style>