<!--
  - Copyright (c) 2021 Loper.me <bizrenay@gmail.com>
  -
  - Licensed under the Apache License, Version 2.0 (the "License");
  - you may not use this file except in compliance with the License.
  - You may obtain a copy of the License at
  -
  -     http://www.apache.org/licenses/LICENSE-2.0
  -
  - Unless required by applicable law or agreed to in writing, software
  - distributed under the License is distributed on an "AS IS" BASIS,
  - WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  - See the License for the specific language governing permissions and
  - limitations under the License.
  -->

<template>
  <div class="rules">
    <div class="row">
      <div class="col-md-12">
        <Title
          class="animate__animated animate__fadeInDown"
          :title="'правила'"
          :subtitle="'для тех, кто их читает'"
          :content="'Незнание правил не освобождает от ответсвенности.'"
        />
      </div>

      <div class="col-md-12">
        <div class="accordion animate__animated animate__fadeInUp">
          <div
            v-for="(item, i) in contents"
            :key="i"
            class="accordion-item"
          >
            <button
              :id="`accordion-button-${i}`"
              :aria-expanded="i === selectedAccordion ? 'true' : 'false'"
              @click="changeAccordion(i)"
            >
              <span class="accordion-title">{{ i + 1 }}. {{ item.title }}</span>
              <span
                class="icon"
                aria-hidden="true"
              />
            </button>
            <div class="accordion-content">
              <p
                v-for="(text, t) in item.content"
                :key="i+t"
                class="accordion-text"
              >
                {{ i + 1 }}.{{ t + 1 }} {{ text }}
              </p>
            </div>
          </div>
        </div>

        <div />
      </div>
    </div>
  </div>
</template>

<script lang="ts">
import { Component, Vue } from 'vue-property-decorator'
import Title from '@/components/Title.vue'

@Component({
  components: {
    Title
  }
})
export default class extends Vue {
  private selectedAccordion = -1

  private contents: {
    title: string
    content: string[]
  }[] = [
    {
      title: 'Общее положение',
      content: [
        'Играя на наших серверах, вы тем самым соглашаетесь со всеми правилами, перечисленными ниже. В случае несогласия, игрок обязуется прекратить использование сервисов проекта.',
        'Незнание правил не освобождает вас от ответственности. Взлом вашего аккаунта не является оправданием, если вас обвиняют в нарушении правил.',
        'Администратор управляет проектом строго по своему усмотрению и вправе наказать игрока по причине, не указанной в правилах и без объяснения причин.',
        'Сервис бесплатен и предоставляется «как есть» без каких-либо гарантий правильной работы. Администратор и Модераторы не возвращают вещи, потерянные в результате бага, отката, обмана, гриферства, воровства и т.д. и т.п.',
        'Все пожертвования, которые делаются игроками, делаются на добровольной основе и идут на поддержку и развитие всего проекта и серверов и осуществляются только через Наш сайт.',
        'Все изменения правил согласуются с Администратором и дополняются, если они не полны или не ясны.',
        'Администрация вправе изменить правила в любой момент без оповещения об этом игроков.',
        'Moderator и/или Helper – доверенное лицо администрации - это игрок, ответственный за поддержание порядка на на сервере(серверах) вверенных ему, обязательно соблюдающий настоящие Правила.',
        'Модераторы/Хелперы не трактуют правила буквально или же формально, в спорных вопросах руководствуются лишь целью созданных правил и соображениями здравого смысла. Каждая спорная ситуация, возникшая в игре, решается строго индивидуально, возможно с привлечением администрации.',
      ]
    },
    {
      title: "Игровой мир",
      content: [
        'Запрещены раздачи в любом виде, нарушение экономики, покупка/продажа вещей по несопоставимой цене. Раздача - это массовая выдача или выдача конкретным лицам (например, подписчикам) любыми способами (например: расприват, выкидывание из инвентаря, ломание сундуков и т.д. и т.п.) ценных вещей в любом количестве под любым предлогом (ивент, конкурсы для подписчиков и т.д. и т.п.).',
        'Игрок обязан следить за состоянием своего имущества, а также прилегающий территории в размере 15-20 кубов.',
        'Запрещается ложь администрации/представителям администрации, оскорбления, угрозы в игровом мире или социальных сетях или мессенджерах на страничках проекта а также в личных сообщениях других игроков, провокации (на табличках, в названиях приватов, на информационных табло и т.д.).',
        'Запрещены любого рода азартные игры (лотереи, казино, кейсы, "ивенты", розыгрыши и пр.), требующие материальных вложений со стороны игрока, построенных другими игроками.',
      ]
    },
    {
      title: 'Аккаунт',
      content: [
        'Ник не должен содержать мата, оскорблений и т.д.',
        'Запрещается предоставлять свой аккаунт 3-м лицам для игры на сервере.',
        'Ответственность несет владелец аккаунта, независимо от того, кто совершал действия под данным аккаунтом.',
        'Запрещена продажа/передача аккаунтов, продажа привилегий.',
        'Донат не переносится на другой ник в целях безопасности.'
      ]
    },
    {
      title: 'Правила поведения игроков на сервере',
      content: [
        'Запрещено всячески мешать другим игрокам играть на сервере.',
        'Запрещено мошенничество, намеренный обман администрации.',
        'Администрация НЕ обязана возвращать вещи потерянные игроком.',
        'Администрация НЕ обязана осуществлять Вам помощь в виде увеличения игрового баланса, помощь в постройке и т.п.',
        'Запрещено попрошайничество (выпрашивать что-либо у администрации/игроков).',
        'Запрещено продавать игровые предметы за реальные деньги.',
        'Простой игрок имеет право помочь новичку ресурсами. для постройки дома и т.д',
        'Игроку запрещено пользоваться любыми сторонними программами для облегчения или изменения игрового процесса.',
        'Вызывание неполадок в работе сервера или попытки обрушить сервер, путем специально вызванных лагов или подобного, влекут за собой глобальный бан.',
        'Запрещена в (любой форме) реклама/скрытая реклама других проектов',
        'Запрещено подстрекать третьих лиц на нарушение правил.',
        'Запрещено обманывать других игроков.',
        'Запрещено выдавать себя за администрацию.'
      ]
    },
    {
      title: 'Для привилегированных игроков на сервере',
      content: [
        'Донатер не имеет право кикать, банить, давать мут без причины.',
        'Донатер не имеет право ломать чужие дома даже если они ему не нравятся.',
        'Донатер не имеет право убивать во флае, режиме "бога", а также в ванише (режим невидимки).',
        'Донатер не имеет право давать бан/кик с причиной "за разбаном в скайп", с нецензурной лексикой, с просьбой о добавлением в регион или оскорблением игрока.',
        'Телепортация без причины и убийство без разрешения игрока запрещена.',
        'Донатерам запрещено забирать у игроков какие-либо вещи и мешать игровому процессу.',
        'Строго запрещается разбанивать игроков, которых забанила администрация.',
        'Попытка нанести вред серверу карается баном навсегда или снятием доната.',
        'Донатер не имеет права раздавать игровые вещи полученные на сервере или от администрации другим игрокам.',
        'Запрещено распространять сторонние сервера, за любое упоминание стороннего сервера - снятие привилегии, бан.',
        'Донатер не имеет право банить другого донатера за нарушение правила из раздела "Правила для донатеров" об нарушении нужно сообщить Сюда приложив к жалобе скрины с доказательствами.'
      ]
    },
    {
      title: 'Условия предоставления платных услуг',
      content: [
        'Деньги, потраченные на платные услуги на сервере, не возвращаются не при каких обстоятельствах.',
        'Попытки махинаций оплатами, или ввод Администрации в заблуждение наказываются баном без возврата средств.',
        'Администрация ни при каких условиях не обязана возвращать вам утраченные вещи, которые вы приобрели за деньги.',
        'Администрация имеет полное право на отказ в предоставление услуг по причинам: неадекватность, требование несуществующих услуг, оскорбления, и т.д.',
        'Предоставьте чек оплаты, если хотите написать Администрации о пропаже, непоявлении доната после покупки. Без данного подтверждения администрация вправе отказать Вам в предоставлении купленной услуги.',
        'Администрация не обязана предоставлять доказательства нарушений донатера у которого сняли привилегию за нарушение выше указанных правил.',
        'Если вы нарушили одно из выше перечисленных правил, и у вас забрали привилегию - то вы можете её только заново купить, больше никак.',
        'Донат из кейсов заменяется на последний выпавший.',
        'Перед покупкой донат-услуг, убедитесь, что Вы зарегистрированы на сервере. Иначе донат-услуга может не выдастся.'
      ]
    },
  ]

  public changeAccordion(index: number): void {
    this.selectedAccordion = index == this.selectedAccordion ? -1 : index
  }
}
</script>

<style lang="stylus">
@import '~@/styles/shared/variables.styl'
.accordion-text
  color #a7a7bf
  font-size 1rem
  font-weight 300
  margin 1em 0

  &:first-child
    margin-top 0
</style>

<style lang="stylus" scoped>
@import '~@/styles/common.styl'

.accordion
  justify-content center
  margin-top 2rem
  flex-wrap wrap
  display flex
  width: 100%

  &-item
    border-bottom 1px solid default-primary
    background-color #fdfdfd
    padding 20px
    width 60%

  &-content
    opacity 0
    max-height 0
    overflow hidden
    -webkit-transition opacity .3s linear, height .3s linear, max-height .3s linear, padding .3s linear
    transition opacity .3s linear, height .3s linear, max-height .3s linear, padding .3s linear
    will-change opacity, height, max-height

  &-title
    padding 1em 1.5em 1em 0
    @extend .disable-highlight

  button
    color default-secondary
    position relative
    display block
    text-align left
    width 100%
    padding 1em 0
    font-size 1.15rem
    font-weight 400
    border none
    background none
    outline none

    &:hover,
    &:focus,
    &:active
      color darken(default-secondary, 10%)
      cursor pointer

    .icon
      display inline-block
      position absolute
      top 18px
      right 0
      width 22px
      height 22px
      border 1px solid
      border-radius 22px
      transition all .2s linear

      &::before
        display block
        position absolute
        content ""
        top 9px
        left 5px
        width 10px
        height 2px
        background currentColor

      &::after
        display block
        position absolute
        content ""
        top 5px
        left 9px
        width 2px
        height 10px
        background currentColor

  button[aria-expanded="true"]
    color darken(default-secondary, 10%)

    .icon
      &:after
        width 0

    & + .accordion-content
      opacity 1
      max-height 35rem
      padding 0
      will-change opacity, height

@media screen and (max-width: 1024px)
  .accordion
    &-item
      width 100%
</style>
